In [1]:
%load_ext sql

In [2]:
%sql postgresql://wuchenhong@127.0.0.1/isongs

'Connected: wuchenhong@isongs'

In [3]:
%sql SELECT * FROM songplay_table WHERE song_id IS NOT NULL;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(483, 15, 'SOZCTXZ12AB0182364', 'AR5KOSW1187FB35FF4', 818, 1542837407796, 'paid', 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM songplay_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
5 rows affected.

[(2, 8, None, None, 139, 1541106106796, 'free', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (4, 8, None, None, 139, 1541106352796, 'free', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (5, 8, None, None, 139, 1541106496796, 'free', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (6, 8, None, None, 139, 1541106673796, 'free', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"'),
 (7, 8, None, None, 139, 1541107053796, 'free', 'Phoenix-Mesa-Scottsdale, AZ', '"Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36"')]

In [5]:
%sql SELECT * FROM user_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
5 rows affected.

[(8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free'),
 (8, 'Kaylee', 'Summers', 'F', 'free')]

In [6]:
%sql SELECT * FROM song_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
5 rows affected.

[('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, Decimal('218.93179')),
 ('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, Decimal('148.03546')),
 ('SOXVLOJ12AB0189215', 'Amor De Cabaret', 'ARKRRTF1187B9984DA', 0, Decimal('177.47546')),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, Decimal('233.40363')),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, Decimal('209.60608'))]

In [7]:
%sql SELECT * FROM artist_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
5 rows affected.

[('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', Decimal('NaN'), Decimal('NaN')),
 ('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', Decimal('35.14968'), Decimal('-90.04892')),
 ('ARKRRTF1187B9984DA', 'Sonora Santanera', '', Decimal('NaN'), Decimal('NaN')),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', Decimal('NaN'), Decimal('NaN')),
 ('ARXR32B1187FB57099', 'Gob', '', Decimal('NaN'), Decimal('NaN'))]

In [8]:
%sql SELECT * FROM time_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
5 rows affected.

[(1541106106796, 0, 1, 1, 1, 1970, '3'),
 (1541106352796, 0, 1, 1, 1, 1970, '3'),
 (1541106496796, 0, 1, 1, 1, 1970, '3'),
 (1541106673796, 0, 1, 1, 1, 1970, '3'),
 (1541107053796, 0, 1, 1, 1, 1970, '3')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [9]:
# Number of artists
%sql SELECT COUNT(DISTINCT name), COUNT(DISTINCT artist_id) FROM artist_table;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(69, 69)]

In [10]:
# Number of records in songplay_table
%sql SELECT COUNT(*) AS number_of_records FROM songplay_table;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(6820,)]

In [11]:
# Number of songs
%sql SELECT COUNT(DISTINCT song_id), COUNT(DISTINCT title) FROM song_table LIMIT 5;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(71, 71)]

In [12]:
# Number of time
%sql SELECT COUNT(*) FROM time_table;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(6820,)]

In [13]:
# Number of users
%sql SELECT COUNT(user_id), COUNT(DISTINCT user_id), COUNT(DISTINCT (first_name, last_name)) FROM user_table;

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[(6820, 96, 95)]

In [14]:
# Number of users
%sql SELECT first_name, last_name \
    FROM user_table \
    GROUP BY first_name, last_name \
    HAVING COUNT(DISTINCT user_id) != 1

 * postgresql://wuchenhong@127.0.0.1/isongs
1 rows affected.

[('Ava', 'Robinson')]

In [15]:
%sql SELECT user_table.first_name, user_table.last_name, user_table.user_id FROM \
(SELECT first_name, last_name \
FROM user_table \
GROUP BY first_name, last_name \
HAVING COUNT(DISTINCT user_id) != 1) result \
LEFT JOIN user_table \
ON user_table.first_name = result.first_name \
AND user_table.last_name = result.last_name \
GROUP BY user_table.first_name, user_table.last_name, user_table.user_id;

 * postgresql://wuchenhong@127.0.0.1/isongs
2 rows affected.

[('Ava', 'Robinson', 13), ('Ava', 'Robinson', 50)]